# Filename: Brewfile
# Author: Olivier Sirol <czo@free.fr>
# License: GPL-2.0 (http://www.gnu.org/copyleft)
# File Created: 7 March 2015
# Last Modified: Sunday 21 April 2024, 22:10
# $Id: Brewfile,v 1.24 2024/04/21 20:10:42 czo Exp $
# Edit Time: 3:06:43
# Description:
#                   macos brew file
#                   for sonoma (macOS 14.2)
#
#   install brew:
#       /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
#   create Brewfile:
#       brew bundle dump
#   install Brewfile:
#       brew bundle
#   update:
#       brew update && brew upgrade && brew cleanup
#   remove:
#       rm -fr /usr/local/ then uninstall cask
#
# Copyright: (C) 2015-2024 Olivier Sirol <czo@free.fr>

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

cask "adoptopenjdk"

brew "bash"
brew "cdrtools"
brew "clipper"
brew "colordiff"
brew "coreutils"
brew "cvs"
brew "dhex"
brew "dmg2img"
brew "duti"
brew "ffmpeg"
brew "findutils"
brew "gcc"
brew "git"
brew "gnu-sed"
brew "gzip"
brew "htop"
brew "iftop"
brew "imagemagick"
brew "lftp"
brew "macvim"
brew "mas"
brew "midnight-commander"
brew "mist-cli"
brew "mpv"
brew "ncdu"
brew "nmap"
brew "node"
brew "noti"
brew "ocrmypdf"
brew "openvpn"
brew "opus"
brew "p7zip"
brew "par"
brew "pdfsandwich"
brew "pdftk-java"
brew "poppler"
brew "reattach-to-user-namespace"
brew "rsync"
brew "squashfs"
brew "subversion"
brew "tcpdump"
brew "telnet"
brew "tesseract"
brew "tesseract-lang"
brew "tmate"
brew "tmux"
brew "unzip"
brew "wget"
brew "xorriso"
brew "zip"

cask "adoptopenjdk"
cask "adobe-acrobat-reader"
cask "android-commandlinetools"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "arduino"
cask "barrier"
cask "cyberduck"
cask "firefox"
cask "font-meslo-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "gimp"
cask "gitkraken"
cask "google-chrome"
cask "handbrake"
cask "hex-fiend"
cask "inkscape"
cask "iterm2"
cask "keka"
cask "kid3"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "openvpn-connect"
cask "openzfs"
cask "pdfsam-basic"
cask "pictureview"
cask "platypus"
cask "rectangle"
cask "skype"
cask "stats"
cask "stremio"
cask "timemachineeditor"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
# cask "wine-stable"
cask "xnviewmp"
cask "xquartz"
cask "zoom"

mas "AJA System Test Lite", id: 1092006274
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "Image2icon", id: 992115977
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Photos Duplicate Cleaner", id: 592704001
mas "Surfshark", id: 1437809329
mas "WhatsApp", id: 1147396723



## delete cask
# brew uninstall --force --cask "adoptopenjdk"
# brew uninstall --force --cask "adobe-acrobat-reader"
# brew uninstall --force --cask "android-commandlinetools"
# brew uninstall --force --cask "android-file-transfer"
# brew uninstall --force --cask "android-platform-tools"
# brew uninstall --force --cask "android-studio"
# brew uninstall --force --cask "arduino"
# brew uninstall --force --cask "barrier"
# brew uninstall --force --cask "cyberduck"
# brew uninstall --force --cask "firefox"
# brew uninstall --force --cask "font-meslo-for-powerline"
# brew uninstall --force --cask "font-source-code-pro-for-powerline"
# brew uninstall --force --cask "gimp"
# brew uninstall --force --cask "gitkraken"
# brew uninstall --force --cask "google-chrome"
# brew uninstall --force --cask "handbrake"
# brew uninstall --force --cask "hex-fiend"
# brew uninstall --force --cask "inkscape"
# brew uninstall --force --cask "iterm2"
# brew uninstall --force --cask "itsycal"
# brew uninstall --force --cask "keka"
# brew uninstall --force --cask "kid3"
# brew uninstall --force --cask "libreoffice"
# brew uninstall --force --cask "libreoffice-language-pack"
# brew uninstall --force --cask "meld"
# brew uninstall --force --cask "microsoft-auto-update"
# brew uninstall --force --cask "microsoft-office"
# brew uninstall --force --cask "openvpn-connect"
# brew uninstall --force --cask "openzfs"
# brew uninstall --force --cask "pdfsam-basic"
# brew uninstall --force --cask "pictureview"
# brew uninstall --force --cask "platypus"
# brew uninstall --force --cask "rectangle"
# brew uninstall --force --cask "skype"
# brew uninstall --force --cask "stats"
# brew uninstall --force --cask "stremio"
# brew uninstall --force --cask "timemachineeditor"
# brew uninstall --force --cask "tunnelblick"
# brew uninstall --force --cask "virtualbox"
# brew uninstall --force --cask "visual-studio-code"
# brew uninstall --force --cask "vlc"
# brew uninstall --force --cask "wine-stable"
# brew uninstall --force --cask "xnviewmp"
# brew uninstall --force --cask "xquartz"
# brew uninstall --force --cask "zoom"
